* Set up the conda environment

It is very important to make sure you get the recent version of
cromwell, conda has some quite old versions available, and atomic
workflow needs something relatively recent. (The version 40 of
cromwell I accidentally installed on my first try definitely did not
work).

This block should install most of the dependencies to run
single-cell-pipeline into a [[https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html][conda environment]]. Conda-forge recommends
[[https://mamba.readthedocs.io/en/latest/user_guide/mamba.html][mamba]] and I found [[https://mamba.readthedocs.io/en/latest/installation/micromamba-installation.html][micromamba]] to be easiest to install, though it is a
bit limited compared to conda or mamba.

You will need to replace the ${defaults["conda_command"]} and
${defaults["environment"]} with appropriate settings for your
environment.


#+name: create-single-cell-pipeline-environment
#+begin_src bash :var defaults=default-table
  ${defaults['conda_command']} create -q \
             -n ${defaults['environment']} \
             -c conda-forge -c bioconda \
             'cromwell>=86' \
             singularity \
             gsutil \
             'synapseclient>=4' >/dev/null &
#+end_src

#+RESULTS: create-single-cell-pipeline-environment

Once that process finishes, you can use the following run commands to
make sure the main components were installed.

#+name: check-single-cell-pipeline-environment
#+begin_src bash :var defaults=default-table
  ${defaults['conda_command']} run -n ${defaults['environment']} womtool --version
  ${defaults['conda_command']} run -n ${defaults['environment']} cromwell --version
  ${defaults['conda_command']} run -n ${defaults['environment']} singularity --version
  ${defaults['conda_command']} run -n ${defaults['environment']} gsutil --version
  ${defaults['conda_command']} run -n ${defaults['environment']} synapse --version
#+end_src

#+RESULTS: check-single-cell-pipeline-environment
| womtool     | 86       |       |
| cromwell    | 86       |       |
| singularity | version  | 3.8.6 |
| gsutil      | version: |   5.3 |
| Synapse     | Client   | 4.4.0 |

Next we check-out the IGVF single-cell pipeline repository. As of the time I am
writing this, we are using release v1

#+name: checkout-atomic-workflow
#+begin_src bash :var defaults=default-table :async yes :results none
  pushd ${defaults['root_dir']}
  git clone ${defaults['atomic_workflows_git']} -b updated-qcs
  popd
#+end_src

